// 1. Логічні оператори  порівняння та alert:
// Створіть змінні number1 та number2 і використайте оператори порівняння, 
// щоб визначити, чи вони рівні.
// Виведіть результат за допомогою alert, щоб повідомити користувача про те, чи рівні числа.

let number1 = 4;
let number2 = 15;

console.log (`4 == 15 = ${number1 == number2}`); 
alert (`4 == 15 = ${number1 == number2}`);

console.log (`4 == 15 = ${number1 === number2}`); 
alert (`4 == 15 = ${number1 === number2}`);

console.log (`4 == 15 = ${number1 != number2}`); 
alert (`4 == 15 = ${number1 != number2}`);

console.log (`4 == 15 = ${number1 !== number2}`); 
alert (`4 == 15 = ${number1 !== number2}`);

console.log (`4 == 15 = ${number1 > number2}`); 
alert (`4 == 15 = ${number1 > number2}`);

console.log (`4 == 15 = ${number1 < number2}`); 
alert (`4 == 15 = ${number1 < number2}`);

console.log (`4 == 15 = ${number1 <= number2}`); 
alert (`4 == 15 = ${number1 <= number2}`);

console.log (`4 == 15 = ${number1 >= number2}`); 
alert (`4 == 15 = ${number1 >= number2}`);



// 2. Метод вводу інформації та логічні порівняння:
// Використовуючи prompt, запросіть у користувача введення числа.
// Перевірте, чи введене число парне чи непарне.
// Виведіть результат з використанням console.log.

let promptResult = prompt('Напишіть парне число');
console.log (`Результат перевірки Вашого числа: ${promptResult % 2==0}`);



// 3. Логічні порівняння та введення-виведення:
// Використовуючи prompt, запитайте у користувача його вік.
// Перевірте, чи вік менше 18 років.
// Виведіть відповідне повідомлення про те, чи може користувач використовувати певний ресурс.

let promptResult2 = prompt('Введіть Ваш вік');
console.log (`Результат перевірки Вашого віку: ${promptResult2 >= 18}`);
alert (`Ваше право бути на цьому сайті: ${promptResult2 >= 18}`);


// 4. Розрахунок вартості товару та console.log:
// Створіть змінну ціна та кількість товару і присвойте їм значення використовуючи prompt .
// Використовуйте математичні операції для обчислення вартості товару (ціна * кількість).
// Виведіть результат за допомогою console.log.

let Price = prompt('Напишіть число, яке буде ціною одного олівця (гривні)');
let Quantity = prompt('Напишіть число, яке буде кількістю наявних олівців (штуки)');
console.log (`Загальна вартість всіх олівців: ${Price * Quantity}`);


// 5. Розрахунок знижки на товар та alert:
// Використовуючи prompt, запросіть в користувача вартість товару.
// Розрахуйте знижку на товар у розмірі 50% від введеної вартості.
// Виведіть результат знижки за допомогою alert.

let Price2 = prompt('Напишіть число, яке буде ціною однієї шаурми із сиром (гривні)');
alert (`50% знижка на шаурму складає: ${Price2 * 0.5} гривень`);